---
kind: type
id: T:Autodesk.Revit.DB.ExportLineweightInfo
source: html/730cd713-bb8b-8a69-739e-d9bae8eb6fa5.htm
---
# Autodesk.Revit.DB.ExportLineweightInfo

A value used to represent the info stored in the ExportLineweightTable .

## Syntax (C#)
```csharp
public class ExportLineweightInfo : IDisposable
```